Tarea 2/LaminarChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)			//vertice 0
    (0.5 0 0)		//vertice 1
    (0.5 10 0)		//vertice 2
    (0 10 0)		//vertice 3	
    (0 0 1)			//vertice 4
    (0.5 0 1)		//vertice 5
    (0.5 10 1)		//vertice 6
    (0 10 1)		//vertice 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) 
    (10 100 1) 
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    inlet
    {
        type patch;
        faces
        (
            (0 1 4 5)
        );
    }
    outlet
    {
        type patch ;
        faces
        (
            (2 3 6 7)
        );

    }
    upperWall
    {
        type patch;
        faces
        (
            (0 3 4 7)
        );      
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 2 5 6)
        );        
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );  
    }

);

// **************************************************************** //  